In [2]:
import numpy as np
import pandas as pd
import scipy.stats as stats

In [6]:
weather_df = pd.read_csv('data/temperature.csv')

weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45253 entries, 0 to 45252
Data columns (total 37 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   datetime           45253 non-null  object
 1   Vancouver          44458 non-null  float64
 2   Portland           45252 non-null  float64
 3   San Francisco      44460 non-null  float64
 4   Seattle            45250 non-null  float64
 5   Los Angeles        45250 non-null  float64
 6   San Diego          45252 non-null  float64
 7   Las Vegas          45252 non-null  float64
 8   Phoenix            45250 non-null  float64
 9   Albuquerque        45252 non-null  float64
 10  Denver             45252 non-null  float64
 11  San Antonio        45252 non-null  float64
 12  Dallas             45249 non-null  float64
 13  Houston            45250 non-null  float64
 14  Kansas City        45252 non-null  float64
 15  Minneapolis        45240 non-null  float64
 16  Saint Louis        45252 non-null  float64
 17  Chicago            45250 non-null  float64
 18  Nashville          45251 non-null  float64
 19  Indianapolis       45246 non-null  float64
 20  Atlanta            45247 non-null  float64
 21  Detroit            45252 non-null  float64
 22  Jacksonville       45252 non-null  float64
 23  Charlotte          45250 non-null  float64
 24  Miami              44448 non-null  float64
 25  Pittsburgh         45250 non-null  float64
 26  Toronto            45252 non-null  float64
 27  Philadelphia       45250 non-null  float64
 28  New York           44460 non-null  float64
 29  Montreal           45250 non-null  float64
 30  Boston             45250 non-null  float64
 31  Beersheba          44455 non-null  float64
 32  Tel Aviv District  44460 non-null  float64
 33  Eilat              44461 non-null  float64
 34  Haifa              44455 non-null  float64
 35  Nahariyya          44456 non-null  float64
 36  Jerusalem          44460 non-null  float64
dtypes: float64(36), object(1)
memory usage: 12.8+ MB

In [45]:
sd_df = weather_df[['datetime', 'San Diego']]

sd_df = sd_df.dropna()
sd_df['San Diego'] = sd_df['San Diego'] - 273.15
sd_df

                  datetime  San Diego
1      2012-10-01 13:00:00  18.380000
2      2012-10-01 14:00:00  18.383501
3      2012-10-01 15:00:00  18.393355
4      2012-10-01 16:00:00  18.403209
5      2012-10-01 17:00:00  18.413063
...                    ...        ...
45248  2017-11-29 20:00:00  19.000000
45249  2017-11-29 21:00:00  19.590000
45250  2017-11-29 22:00:00  19.430000
45251  2017-11-29 23:00:00  19.460000
45252  2017-11-30 00:00:00  18.250000

[45252 rows x 2 columns]

In [ ]:
sd16_df = sd_df[(pd.to_datetime(sd_df['datetime']).dt.year == 2016)]
sd16_df['San Diego'].mean()

In [48]:
annual_temp = []

for yr in [2012, 2013, 2014, 2015, 2015, 2017]:
    tmp_df = sd_df[(pd.to_datetime(sd_df['datetime']).dt.year == yr)]
    annual_temp.append(tmp_df['San Diego'].mean())
    
annual_temp

[16.15567756806377,
 16.29193228500732,
 16.998077060928562,
 16.73704391819979,
 16.73704391819979,
 18.010040304647923]

In [50]:
np.mean(annual_temp)

16.82163584250786

In [51]:
np.std(annual_temp, ddof=1)

0.6605807352077044